* Barnes_T081_1978

#+NAME: ingest_meta
#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS: ingest_meta
#+begin_example
Borehole ID                      | Barnes_T081_1978
Place name                       | Barnes Ice Cap
Geographic location              | Canadian Arctic South
Site type                        | Ice cap
Data Source                      | Graphic in science source
Data DOI                         | 
Science Source                   | Hooke, Roger LeB., Alexander, E. Calvin, Gustafson, Robert J.: Temperature profiles in the Barnes Ice Cap, Baffin Island, Canada, and heat flux from the subglacial terrane , Canadian Journal of Earth Sciences 17(9), Canadian Science Publishing, 1174–1188, sep 1980
Science DOI                      | 10.1139/e80-124
Date                             | 1978-06-30
Longitude [°E]                   | -72.155
Latitude [°N]                    | 69.74945
Location Source                  | Location digitized by M. Jacquemart from Gilbert (2016)
Depth of top measurement [m]     | 0.0
Depth of bottom measurement [m]  | 153
Ice thickness [m]                | 173
Coverage [% of thickness]        | 88
Ice thickness source             | See science source
Note                             | "Date is ""Date completed"" from Hooke (1980) Table 1 Column 2 + Days to final measurement (Column 3); Temperature and location digitized by M. Jacquemart from Gilbert (2016)"
#+end_example


** Temperature

+ Any notes on source or data
+ Links to key papers

** Thickness

+ Notes on thickness
 
** Location

+ Notes on location

** Data                                                 :noexport:

#+NAME: ingest_data
#+BEGIN_SRC bash :exports results
(head -n1 data.csv && tail -n +2 data.csv | sort -t, -n -k1)
#+END_SRC

#+RESULTS: ingest_data
|         d |          t |
|         0 | -10.977914 |
| 31.516354 | -10.350921 |
|  61.84341 |  -9.723927 |
|  91.87314 |   -9.03681 |
| 114.17245 |  -8.650307 |
|  129.6333 |  -8.392638 |
| 152.52725 |  -8.040491 |


